In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame({
    'A': [1, 2, 3 ,4,5],
    'B': [60, 70, 80,90,100],
    'C': [100, 200, 300,400,500]
})

df1

   A    B    C
0  1   60  100
1  2   70  200
2  3   80  300
3  4   90  400
4  5  100  500

In [4]:
df1.shape

(5, 3)

In [9]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [12]:
df1.describe()

              A           B           C
count  5.000000    5.000000    5.000000
mean   3.000000   80.000000  300.000000
std    1.581139   15.811388  158.113883
min    1.000000   60.000000  100.000000
25%    2.000000   70.000000  200.000000
50%    3.000000   80.000000  300.000000
75%    4.000000   90.000000  400.000000
max    5.000000  100.000000  500.000000

In [14]:
df1['A']+10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

In [16]:
def square(x):
    return x**2

In [18]:
df1["B"].apply(square)

0     3600
1     4900
2     6400
3     8100
4    10000
Name: B, dtype: int64

In [22]:
df1['D'] = df1['B'].apply(lambda x : x**2)

df1

   A          B    C                  D
0  1   12960000  100    167961600000000
1  2   24010000  200    576480100000000
2  3   40960000  300   1677721600000000
3  4   65610000  400   4304672100000000
4  5  100000000  500  10000000000000000

In [20]:
df1['B'] =df1["B"].apply(square)
df1

   A          B    C
0  1   12960000  100
1  2   24010000  200
2  3   40960000  300
3  4   65610000  400
4  5  100000000  500

Finding Data